In [1]:
people={
    "first":["Kirti","Saket","Hrisabh"],
    "last":["Kumar","Tiwari","Mishra"],
    "email":["kirti@gmail.com","saket@gmail.com","hri@gmail.com"]
}

In [2]:
import pandas as pd

In [3]:
df=pd.DataFrame(people)

In [4]:
df

     first    last            email
0    Kirti   Kumar  kirti@gmail.com
1    Saket  Tiwari  saket@gmail.com
2  Hrisabh  Mishra    hri@gmail.com

In [5]:
df['first']+' ' +df['last']

0       Kirti Kumar
1      Saket Tiwari
2    Hrisabh Mishra
dtype: object

In [6]:
df['full_name']=df['first']+' ' +df['last']

In [7]:
df

     first    last            email       full_name
0    Kirti   Kumar  kirti@gmail.com     Kirti Kumar
1    Saket  Tiwari  saket@gmail.com    Saket Tiwari
2  Hrisabh  Mishra    hri@gmail.com  Hrisabh Mishra

In [8]:
df['phonenumber']=['123','321','456']

In [9]:
df

     first    last            email       full_name phonenumber
0    Kirti   Kumar  kirti@gmail.com     Kirti Kumar         123
1    Saket  Tiwari  saket@gmail.com    Saket Tiwari         321
2  Hrisabh  Mishra    hri@gmail.com  Hrisabh Mishra         456

In [20]:
phonenumber=['9123435','2234536','435456587']

In [21]:
df['phonenumber']=phonenumber

In [23]:
df

     first    last            email       full_name phonenumber
0    Kirti   Kumar  kirti@gmail.com     Kirti Kumar     9123435
1    Saket  Tiwari  saket@gmail.com    Saket Tiwari     2234536
2  Hrisabh  Mishra    hri@gmail.com  Hrisabh Mishra   435456587

In [25]:
df.drop(columns=['first','last'],inplace=True)

In [27]:
df['full_name'].str.split(' ',expand=True)

         0       1
0    Kirti   Kumar
1    Saket  Tiwari
2  Hrisabh  Mishra

In [28]:
df[['first','last']]=df['full_name'].str.split(' ',expand=True)

In [29]:
df

             email       full_name phonenumber    first    last
0  kirti@gmail.com     Kirti Kumar     9123435    Kirti   Kumar
1  saket@gmail.com    Saket Tiwari     2234536    Saket  Tiwari
2    hri@gmail.com  Hrisabh Mishra   435456587  Hrisabh  Mishra

In [30]:
df.append({'first':'Vineet'},ignore_index=True)

             email       full_name phonenumber    first    last
0  kirti@gmail.com     Kirti Kumar     9123435    Kirti   Kumar
1  saket@gmail.com    Saket Tiwari     2234536    Saket  Tiwari
2    hri@gmail.com  Hrisabh Mishra   435456587  Hrisabh  Mishra
3              NaN             NaN         NaN   Vineet     NaN

In [31]:
df

             email       full_name phonenumber    first    last
0  kirti@gmail.com     Kirti Kumar     9123435    Kirti   Kumar
1  saket@gmail.com    Saket Tiwari     2234536    Saket  Tiwari
2    hri@gmail.com  Hrisabh Mishra   435456587  Hrisabh  Mishra

In [32]:
people={
    "first":["Avinash","Addy"],
    "last":["Kumar","Tiwari"],
    "email":["avi@gmail.com","addy@gmail.com"]
}

In [33]:
df2=pd.DataFrame(people)

In [34]:
df2

     first    last           email
0  Avinash   Kumar   avi@gmail.com
1     Addy  Tiwari  addy@gmail.com

In [35]:
df.append(df2,ignore_index=True)

             email       full_name phonenumber    first    last
0  kirti@gmail.com     Kirti Kumar     9123435    Kirti   Kumar
1  saket@gmail.com    Saket Tiwari     2234536    Saket  Tiwari
2    hri@gmail.com  Hrisabh Mishra   435456587  Hrisabh  Mishra
3    avi@gmail.com             NaN         NaN  Avinash   Kumar
4   addy@gmail.com             NaN         NaN     Addy  Tiwari

In [38]:
df=df.append(df2,ignore_index=True)

In [42]:
df

             email       full_name phonenumber    first    last
0  kirti@gmail.com     Kirti Kumar     9123435    Kirti   Kumar
1  saket@gmail.com    Saket Tiwari     2234536    Saket  Tiwari
2    hri@gmail.com  Hrisabh Mishra   435456587  Hrisabh  Mishra
3    avi@gmail.com             NaN         NaN  Avinash   Kumar
4   addy@gmail.com             NaN         NaN     Addy  Tiwari
5    avi@gmail.com             NaN         NaN  Avinash   Kumar
6   addy@gmail.com             NaN         NaN     Addy  Tiwari

In [43]:
df.drop(index=6)

             email       full_name phonenumber    first    last
0  kirti@gmail.com     Kirti Kumar     9123435    Kirti   Kumar
1  saket@gmail.com    Saket Tiwari     2234536    Saket  Tiwari
2    hri@gmail.com  Hrisabh Mishra   435456587  Hrisabh  Mishra
3    avi@gmail.com             NaN         NaN  Avinash   Kumar
4   addy@gmail.com             NaN         NaN     Addy  Tiwari
5    avi@gmail.com             NaN         NaN  Avinash   Kumar